//==========================================================
//
// サンプルタスク [sample_task.cpp]
// Author : Ibuki Okusada
//
//==========================================================
#include "ui.h"
#include "object2D.h"
#include "manager.h"
#include "texture.h"

// マクロ定義

//==========================================================
// コンストラクタ
//==========================================================
CUI::CUI()
{
	// 値のクリア
}

//==========================================================
// デストラクタ
//==========================================================
CUI::~CUI()
{

}

//==========================================================
// 初期化処理
//==========================================================
HRESULT CUI::Init(void)
{
	m_pObject = CObject2D::Create();

	m_pObject->BindTexture(CManager::GetInstance()->GetTexture()->Regist("data\\TEXTURE\\frame0.png"));
	m_pObject->SetPosition(m_pos);
	m_pObject->SetRotation(m_rot);
	m_pObject->SetLength(300.0f, 150.0f);

	return S_OK;
}

//==========================================================
// 終了処理
//==========================================================
void CUI::Uninit(void)
{
	Release();
}

//==========================================================
// 更新処理
//==========================================================
void CUI::Update(void)
{
	//サイズの設定
	m_pObject->SetVtx();
}

//==========================================================
// 生成
//==========================================================
CUI *CUI::Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot)
{
	CUI *pUI = nullptr;

	pUI = new CUI;

	if (pUI != nullptr)
	{
		pUI->SetPosition(pos);
		pUI->SetRotation(rot);

		// 初期化処理
		pUI->Init();
	}	

	return pUI;
}